Revit 2027 API
RoutingPreferenceRule.NumberOfCriteria Property
 Gets the number of routing criteria.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfCriteria { get; }
Public ReadOnly Property NumberOfCriteria As Integer
	Get
public:
property int NumberOfCriteria {
	int get ();
}
member NumberOfCriteria : int with get
Property Value
Int32
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace